// 공개 콘텐츠: 관리자 공개 저장 시 GitHub에 커밋됩니다.
window.PAGE_CONTENT = {
  "name": "김동오",
  "intro": "| 나이 : 31세\n| 생년월일 : 1996.04.13\n| 메일 : tonic0413@naver.com\n| 좋아하는 노래 : Jazzfact - Always awake",
  "purpose": "처음 만나는 동료와 저에게 관심있는 모든 분들에게 나의 관심사와 활동의 근거를 보여 주고 연결되기 위한 페이지입니다.",
  "facts": [
    {
      "title": "자기주도적인 기술 습득을 위한 꾸준히 배우고 성장하기",
      "situation": "기술 발전이 빠른 상황 속에서 적응하기 위해 검색하고 공부를 진행",
      "action": "1. 풀스택 부트캠프 수료\n2. Antigravity를 활용한 정형화된 디자인시스템을 활용한 화면 만들기\n3. 로컬 LLM 연동\n4. optuna를 활용한 머신러닝 데이터 진단 및 모델 비교(AutoML 도구)\n5. 텔레그램 봇 만들기\n6. Inflearn ML 데이터 분석 강의\n7. MicrosoftStore에 몰입시계 배포\n8. AI를 활용한 냉동식품 프로토타입 사이트(지인 요청)",
      "result": "https://github.com/Dong-DDack\n* 4,5,6,7 확인 가능\nhttps://frozen-catalog-dokim.dongee1214.chatgpt.site/\n* 8 확인 가능"
    },
    {
      "title": "구조적 문제 해결 능력",
      "situation": "업무를 수행하면서 일정 지연이 발생하는 경우가 많음을 느꼈으며, 원인을 되짚어본 결과 개인의 능력 부족보다는 요구사항을 명확히 이해하지 못한 상태에서 작업을 시작하는 경우가 큰 비중을 차지하는 것을 확인",
      "action": "프로젝트 착수 전 요구사항을 재정리 후 누락된 부분이 없는지 검토하는 과정을 습관화하고 요청자의 의도를 기반으로 내용을 해석한 뒤, 작업 방향이 나의 시선과 일치하는지 사전에 확인하는 절차를 나에게 추가함",
      "result": "불필요한 수정과 반복적인 피드백 과정과 회의를 줄일 수 있었고, 결과적으로 작업효율과 일정 준수율을 높임"
    },
    {
      "title": "목표 지향적 회복탄력성",
      "situation": "웹 개발 IT 기업에서 직무전환을 위해 새로운 영역을 공부해야하는 상황",
      "action": "1. Inflearn을 통해 부족한 영역 학습\n2. github 생성 및 AI를 활용한 프로젝트 등록\n3. Youtube와 AI 검색을 통해 부족한 부분 학습",
      "result": "https://github.com/Dong-DDack\n취업 성공으로 증명해내기!"
    }
  ],
  "publicInfo": [
    "내가 알고 있는 전문적 기술 지식",
    "강점·취향과 상황·행동·결과",
    "내가 좋아하는 관심사"
  ],
  "image": "김동오 증명사진.jpg",
  "privateInfo": [
    "퇴사 사유",
    "희망 연봉",
    "전문적 영역과 무관한 깊은 개인 사생활"
  ],
  "timeline": [
    {
      "title": "쉬는것도 경쟁력이다!",
      "text": "팀원들과 잡담을 하면서 아이디어를 얻으며, 작업 흐름과 문제를 팀과 공유하여 질문과 피드백을 통해 팀원들간 상호작용하고 서로 보완이 되는 협업을 좋아합니다.",
      "tags": [
        "협업",
        "문제해결"
      ]
    },
    {
      "title": "공부 후 연결하는 시도!",
      "text": "공부 후 끝나는 것이 아닌 실제로 적용하고 도구를 연동합니다.\n로컬LLM을 DB 연동하고 텔레그램 봇을 통해 크롤링한 내용을 알려주는 봇을 만들며, 몰입시계라는 Microsoft Store 배포 및 AI를 활용한 냉동식품 사이트 프로토타입을 만들었습니다.",
      "tags": [
        "연결",
        "LocalLLM",
        "Telegram Bot",
        "Microsoft Store",
        "AI Prototype"
      ]
    },
    {
      "title": "지속적인 성장을 위한 도전!",
      "text": "기술발전에 있어 정체되지 않고 지속적인 성장을 위해 강의와 교육을 찾아 듣고 시도하면서 저의 기술 발전을 위해 성장해 나아가고 있습니다.",
      "tags": [
        "성장",
        "도전",
        "시도"
      ]
    }
  ]
};
